### Youâ€™re given two dataframes. One contains information about addresses and the other contains relationships between various cities and states
### Write a function complete_address to create a single dataframe with complete addresses in the format of street, city, state, zipcode.

In [1]:
import pandas as pd

In [2]:
addresses = {"address": ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]}

cities = {"city": ["Salt Lake City", "Kansas City", "Detroit", "Tampa", "San Francisco"], "state": ["Utah", "Missouri", "Michigan", "Florida", "California"]}

df_addresses = pd.DataFrame(addresses)
df_cities = pd.DataFrame(cities)

In [3]:
df_addresses.head()

                                       address
0  4860 Sunset Boulevard, San Francisco, 94105
1    3055 Paradise Lane, Salt Lake City, 84103
2              682 Main Street, Detroit, 48204
3        9001 Cascade Road, Kansas City, 64102
4               5853 Leon Street, Tampa, 33605

In [4]:
df_cities.head()

             city       state
0  Salt Lake City        Utah
1     Kansas City    Missouri
2         Detroit    Michigan
3           Tampa     Florida
4   San Francisco  California

In [5]:
df_addresses[['street','city','zip']] = df_addresses['address'].str.split(",", expand=True)
df_addresses['street'] = df_addresses['street'].astype(str)
df_addresses['street'] = df_addresses['street'].str.strip()
df_addresses['city'] = df_addresses['city'].astype(str)
df_addresses['city'] = df_addresses['city'].str.strip()
df_addresses['zip'] = df_addresses['zip'].astype(str)
df_addresses['zip'] = df_addresses['zip'].str.strip()
df_addresses.drop(columns='address', inplace=True)
df_addresses.head()

                  street            city    zip
0  4860 Sunset Boulevard   San Francisco  94105
1     3055 Paradise Lane  Salt Lake City  84103
2        682 Main Street         Detroit  48204
3      9001 Cascade Road     Kansas City  64102
4       5853 Leon Street           Tampa  33605

In [6]:
df_merge = pd.merge(df_addresses, df_cities, on='city', how='left') 
df_merge

                  street            city    zip       state
0  4860 Sunset Boulevard   San Francisco  94105  California
1     3055 Paradise Lane  Salt Lake City  84103        Utah
2        682 Main Street         Detroit  48204    Michigan
3      9001 Cascade Road     Kansas City  64102    Missouri
4       5853 Leon Street           Tampa  33605     Florida

In [7]:
df_merge['address'] = df_merge['street'].str.cat(df_merge[['city','state','zip']], sep=',') 
df_merge.drop(['street','city','state','zip'], axis=1, inplace=True)
df_merge

                                             address
0  4860 Sunset Boulevard,San Francisco,California...
1       3055 Paradise Lane,Salt Lake City,Utah,84103
2             682 Main Street,Detroit,Michigan,48204
3       9001 Cascade Road,Kansas City,Missouri,64102
4               5853 Leon Street,Tampa,Florida,33605

### END